cfe llm/InformationRegisters/AI_ОчередьПодготовкиКВекторизации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>AI_ОчередьПодготовкиКВекторизации</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаПостановки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Ссылка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cfe llm/InformationRegisters/AI_ОчередьВекторизации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>AI_ОчередьВекторизации</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЗаголовокЧанка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подзаголовок</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодзаголовокВторогоУровня</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВсегоЧанков</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЧанка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторЧанка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Данные</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтекстТекст</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтображаемыйТекст</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>_ИсточникТипДанных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникВнутреннийТип</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НавигационнаяСсылка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторСущности</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Секция</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОрганизацияИГуид</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тенант</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Язык</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХешДанных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Разрешения</Name>
					<Comment /><Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
					<FillFromFillingValue>false</FillFromFillingValue>				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Коллекция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.AI_RAGКоллекции</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УникальныйИдентификатор</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cfe llm/InformationRegisters/AI_ИдентификаторыЧанков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>AI_ИдентификаторыЧанков</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ХэшДанных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вектор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ТипСущности</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НавигационнаяСсылка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторЧанка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерЧанка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХешДанных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cfe llm/Enums/AI_ТипыРазрешенийRAG.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>AI_ТипыРазрешенийRAG</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Организация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Тенант</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Право</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТипДанных</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cfe llm/Catalogs/AI_RAGКоллекции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>AI_RAGКоллекции</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.AI_RAG</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОписаниеКоллекции</Name>					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипКоллекции</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоллекцияИнициализирована</Name>					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>_Overlap</Name>					<Comment>Еще не используется</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТипыДанныхКоллекции</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НаименованиеТипаСтрокой</Name>							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cfe llm/Catalogs/AI_RAG.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>AI_RAG</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.AI_Провайдеры</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Активен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>EmbeddingURL</Name>					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>EmbeddingМодель</Name>					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>EmbeddingРазмерность</Name>					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>EmbeddingТаймаутСек</Name>					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>EmbeddingAPIКлюч</Name>					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>QdrantURL</Name>					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>QdrantAPIКлюч</Name>					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>QdrantТаймаутСек</Name>					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cfe llm/CommonModules/AI_RAG/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Регламентное задание AI_ОбработкаОчередиПодготовкиКВекторизации: раскладывает объекты
// очереди подготовки на фрагменты по типам ссылок. Сборщик фрагментов для каждого типа
// пишет проект внедрения (см. ОбработкаМассиваОчередиПодготовкиПоТипу). Тип без сборщика
// не останавливает остальные типы, но задание завершается ошибкой, чтобы пропуск был виден.
Процедура AI_ОбработкаОчередиПодготовкиКВекторизации() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	AI_ОчередьПодготовкиКВекторизации.Ссылка КАК Ссылка,
		|	ТИПЗНАЧЕНИЯ(AI_ОчередьПодготовкиКВекторизации.Ссылка) КАК ТипСсылки
		|ИЗ
		|	РегистрСведений.AI_ОчередьПодготовкиКВекторизации КАК AI_ОчередьПодготовкиКВекторизации
		|ИТОГИ ПО
		|	ТипСсылки";

	ОбходПоТипамСсылок = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ОшибкиТипов = Новый Массив;

	Пока ОбходПоТипамСсылок.Следующий() Цикл

		МассивОбъектовТипа = Новый Массив;

		ВыборкаПоСсылкам = ОбходПоТипамСсылок.Выбрать();

		Пока ВыборкаПоСсылкам.Следующий() Цикл
			МассивОбъектовТипа.Добавить(ВыборкаПоСсылкам.Ссылка);
		КонецЦикла;

		Попытка
			ОбработкаМассиваОчередиПодготовкиПоТипу(МассивОбъектовТипа, ОбходПоТипамСсылок.ТипСсылки);
		Исключение
			ОшибкиТипов.Добавить(ОписаниеОшибки());
		КонецПопытки;

	КонецЦикла;

	Если ОшибкиТипов.Количество() > 0 Тогда
		ВызватьИсключение СтрСоединить(ОшибкиТипов, Символы.ПС);
	КонецЕсли;

КонецПроцедуры

// ИнициализироватьКоллекциюВQdrant
// Проверяет коллекцию в Qdrant, создает ее, если коллекции нет, и отмечает
// в справочнике созданной. Коллекцию, созданную вне 1С, не пересоздает: сверяет
// размер вектора с подключением и только ставит флажок.
//
// Параметры:
//   Коллекция       - СправочникСсылка.AI_RAGКоллекции - элемент коллекции
//   КомпонентRAG    - Структура - данные RAG-компонента (см. ДанныеRAGАгента)
//
// Возвращаемое значение:
//   Структура - { Успех: Булево, Описание: Строка }
Функция ИнициализироватьКоллекциюВQdrant(Коллекция, КомпонентRAG) Экспорт

	Результат = НовыйРезультатОперации();

	Попытка

		ИмяКоллекции = Коллекция.Наименование;
		Состояние = СостояниеКоллекцииQdrant(КомпонентRAG, ИмяКоллекции);

		Если Не Состояние.Существует Тогда
			СоздатьКоллекциюQdrant(КомпонентRAG, ИмяКоллекции);
		ИначеЕсли ЗначениеЗаполнено(КомпонентRAG.EmbeddingРазмерность)
			И ЗначениеЗаполнено(Состояние.РазмерВектора)
			И Состояние.РазмерВектора <> КомпонентRAG.EmbeddingРазмерность Тогда
			ВызватьИсключение СтрШаблон(
				"Коллекция [%1] в Qdrant хранит векторы размера %2, а в подключении RAG [%3] указан размер %4.",
				ИмяКоллекции,
				Состояние.РазмерВектора,
				КомпонентRAG.Наименование,
				КомпонентRAG.EmbeddingРазмерность);
		КонецЕсли;

		ОтметитьКоллекциюИнициализированной(Коллекция);

		Результат.Успех = Истина;

	Исключение
		Результат.Успех    = Ложь;
		Результат.Описание = ОписаниеОшибки();
	КонецПопытки;

	Возврат Результат;

КонецФункции

// ОтправитьДанныеВQdrant
// Получает вектор для текстовых данных и размещает точку в Qdrant.
// Используется из AI_ОбработкаОчередиВекторизации для каждого элемента очереди.
//
// Параметры:
//   КомпонентRAG - Структура          - данные RAG-компонента
//   ИмяКоллекции - Строка             - наименование коллекции в Qdrant
//   МассивТочек  - Массив Из Структура - точки: { Вектор, Payload }
//                  (формируется снаружи, по одной или пакетом)
//
// Возвращаемое значение:
//   Структура - { Успех: Булево, Описание: Строка }
Функция ОтправитьДанныеВQdrant(КомпонентRAG, ИмяКоллекции, МассивТочек) Экспорт

	Результат = НовыйРезультатОперации();

	Попытка

		Если Не ЗначениеЗаполнено(МассивТочек) Или МассивТочек.Количество() = 0 Тогда
			Результат.Успех    = Истина;
			Результат.Описание = "Нет точек для отправки";
			Возврат Результат;
		КонецЕсли;

		// PUT /collections/{name}/points (upsert — идемпотентно). wait=true: точки
		// доступны поиску сразу после ответа, до удаления устаревших фрагментов.
		ТелоЗапроса = Новый Структура;
		ТелоЗапроса.Вставить("points", МассивТочек);

		Ответ = ВыполнитьЗапросQdrant(КомпонентRAG, "PUT",
			СтрШаблон("/collections/%1/points?wait=true", ИмяКоллекции), ТелоЗапроса);
		ПроверитьОтветСервиса("Qdrant", Ответ,
			СтрШаблон("загрузка точек в коллекцию [%1]", ИмяКоллекции));

		Результат.Успех = Истина;

	Исключение
		Результат.Успех    = Ложь;
		Результат.Описание = ОписаниеОшибки();
	КонецПопытки;

	Возврат Результат;

КонецФункции

// ПолучитьСтатусRAG
// Проверяет доступность Embedding-сервиса (GET /models) и Qdrant (GET /healthz)
// с таймаутами подключения.
//
// Параметры:
//   КомпонентRAG - Структура - данные компонента RAG
//
// Возвращаемое значение:
//   Структура - { EmbeddingДоступен, EmbeddingСтатус, QdrantДоступен, QdrantСтатус }
Функция ПолучитьСтатусRAG(КомпонентRAG) Экспорт

	Статус = Новый Структура(
		"EmbeddingДоступен, EmbeddingСтатус, QdrantДоступен, QdrantСтатус",
		Ложь, "", Ложь, "");

	// --- Embedding ---
	Попытка
		// Стандартный healthcheck OpenAI-совместимых серверов: GET /models
		КодEmb = ВыполнитьЗапросEmbedding(КомпонентRAG, "GET", "/models").КодСостояния;

		Статус.EmbeddingДоступен = (КодEmb >= 200 И КодEmb < 300);
		Статус.EmbeddingСтатус   = СтрШаблон("HTTP %1", КодEmb);
	Исключение
		Статус.EmbeddingСтатус = "Ошибка: " + ОписаниеОшибки();
	КонецПопытки;

	// --- Qdrant ---
	Попытка
		// GET /healthz — стандартный endpoint Qdrant
		КодQd = ВыполнитьЗапросQdrant(КомпонентRAG, "GET", "/healthz").КодСостояния;

		Статус.QdrantДоступен = (КодQd >= 200 И КодQd < 300);
		Статус.QdrantСтатус   = СтрШаблон("HTTP %1", КодQd);
	Исключение
		Статус.QdrantСтатус = "Ошибка: " + ОписаниеОшибки();
	КонецПопытки;

	Возврат Статус;

КонецФункции

// Процедура вызывается регламентным заданием AI_ОбработкаОчередиВекторизации.
// Читает AI_ОчередьВекторизации, группирует по коллекции, для каждой порции:
//   1. Проверяет / создаёт коллекцию в Qdrant
//   2. Пропускает чанки без изменений (по хешу через AI_ИдентификаторыЧанков)
//   3. Получает векторы через Embedding-сервис
//   4. Отправляет порции в Qdrant
//   5. Фиксирует результат в AI_ИдентификаторыЧанков и удаляет из очереди
// AI_ОбработкаОчередиВекторизации
// Точка входа — вызывается регламентным заданием.
// Читает очередь, группирует по коллекции, запускает обработку порциями
// через менеджер фоновых заданий (с учётом AI_КоличествоПотоковВекторизации).
Процедура AI_ОбработкаОчередиВекторизации() Экспорт

	// 1. Запрос очереди с группировкой по коллекции
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Очередь.УникальныйИдентификатор КАК УникальныйИдентификатор,
		|	Очередь.Коллекция КАК Коллекция
		|ИЗ
		|	РегистрСведений.AI_ОчередьВекторизации КАК Очередь
		|ИТОГИ ПО
		|	Коллекция";

	РезультатЗапроса = Запрос.Выполнить();

	Если РезультатЗапроса.Пустой() Тогда
		Возврат; // Очередь пуста — выходим
	КонецЕсли;

	КоличествоПотоков = Константы.AI_КоличествоПотоковВекторизации.Получить();
	Если КоличествоПотоков = 0 Тогда
		КоличествоПотоков = 1;
	КонецЕсли;

	// 2. Собираем порции по коллекциям для менеджера фоновых заданий
	МассивПорций = Новый Массив;

	ОбходПоКоллекциям = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

	Пока ОбходПоКоллекциям.Следующий() Цикл

		МассивИдентификаторов = Новый Массив;
		ВыборкаЗаписей = ОбходПоКоллекциям.Выбрать();

		Пока ВыборкаЗаписей.Следующий() Цикл
			МассивИдентификаторов.Добавить(ВыборкаЗаписей.УникальныйИдентификатор);
		КонецЦикла;

		// Параметр для фонового задания: коллекция + её идентификаторы
		ПараметрЗадания = Новый Структура;
		ПараметрЗадания.Вставить("Коллекция",            ОбходПоКоллекциям.Коллекция);
		ПараметрЗадания.Вставить("МассивИдентификаторов", МассивИдентификаторов);

		МассивПорции = Новый Массив;
		МассивПорции.Добавить(ПараметрЗадания);
		
		МассивПорций.Добавить(МассивПорции);

	КонецЦикла;

	// 3. Запускаем через менеджер фоновых заданий из Слоя инфраструктуры
	ПараметрыМенеджера = AI_ОбработкаСервер.ПараметрыМенеджераЗаданий();
	ПараметрыМенеджера.ЗапускаемаяПроцедура = "AI_RAG.ОбработатьПорциюВекторизации";
	ПараметрыМенеджера.НаименованиеЗадания  = "Векторизация данных для RAG";
	ПараметрыМенеджера.ПорцииДанных         = МассивПорций;
	ПараметрыМенеджера.КоличествоПотоков    = КоличествоПотоков;

	AI_ОбработкаСервер.ОжидатьЗавершенияМенеджераФоновыхЗаданий(ПараметрыМенеджера, 5);

КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ПолноеИмяТипаПоСсылке(Ссылка) Экспорт
	
	Если не ЗначениеЗаполнено(Ссылка) Тогда
		ВызватьИсключение "Ссылка не заполнена. Продолжение не возможно";
	КонецЕсли;
	
	НайденныеМетаданные = Метаданные.НайтиПоТипу(ТипЗнч(Ссылка));
	
	Возврат НайденныеМетаданные.ПолноеИмя();
	
КонецФункции

// ДанныеRAGАгента
// Подключения RAG и коллекции, в которых агент ищет фрагменты: только строки
// табличной части RAGКоллекции с отметкой «Использовать» и ненулевым лимитом.
// Результат передается в AI_Клиент (ИнициализироватьСистемныйПромт).
//
// Параметры:
//   Агент - СправочникСсылка.AI_Агенты
//
// Возвращаемое значение:
//   Массив Из Структура - см. ДанныеRAGПоНастройкам
Функция ДанныеRAGАгента(Агент) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Настройки.Использовать КАК Использовать,
		|	Настройки.Коллекция КАК Коллекция,
		|	Настройки.ЛимитФрагментовQdrant КАК ЛимитФрагментовQdrant,
		|	Настройки.ВесКоллекции КАК ВесКоллекции,
		|	Настройки.МинПорогСхожестиВектора КАК МинПорогСхожестиВектора
		|ПОМЕСТИТЬ ВТНастройкиКоллекций
		|ИЗ
		|	Справочник.AI_Агенты.RAGКоллекции КАК Настройки
		|ГДЕ
		|	Настройки.Ссылка = &Агент";
	Запрос.УстановитьПараметр("Агент", Агент);

	Возврат ДанныеRAGПоВременнойТаблице(Запрос);

КонецФункции

// ДанныеRAGПоНастройкам
// То же, что ДанныеRAGАгента, но по строкам настроек, например из песочницы.
//
// Параметры:
//   НастройкиКоллекций - ТаблицаЗначений - колонки с типами, как в табличной части
//                        AI_Агенты.RAGКоллекции: Использовать, Коллекция,
//                        ЛимитФрагментовQdrant, ВесКоллекции, МинПорогСхожестиВектора
//
// Возвращаемое значение:
//   Массив Из Структура - подключения RAG, у каждого поля подключения
//     (КомпонентRAG, Наименование, Активен, EmbeddingURL, EmbeddingМодель,
//     EmbeddingРазмерность, EmbeddingТаймаутСек, EmbeddingAPIКлюч, QdrantURL,
//     QdrantТаймаутСек, QdrantAPIКлюч) и МассивКоллекций - Массив Из Структура:
//     Коллекция, ИмяКоллекции, ТипКоллекции, ЛимитФрагментовQdrant, ВесКоллекции,
//     МинПорогСхожестиВектора.
//   Неактивное подключение или коллекция, не отмеченная созданной в Qdrant, дают исключение.
Функция ДанныеRAGПоНастройкам(НастройкиКоллекций) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Настройки.Использовать КАК Использовать,
		|	Настройки.Коллекция КАК Коллекция,
		|	Настройки.ЛимитФрагментовQdrant КАК ЛимитФрагментовQdrant,
		|	Настройки.ВесКоллекции КАК ВесКоллекции,
		|	Настройки.МинПорогСхожестиВектора КАК МинПорогСхожестиВектора
		|ПОМЕСТИТЬ ВТНастройкиКоллекций
		|ИЗ
		|	&НастройкиКоллекций КАК Настройки";
	Запрос.УстановитьПараметр("НастройкиКоллекций", НастройкиКоллекций);

	Возврат ДанныеRAGПоВременнойТаблице(Запрос);

КонецФункции

// ПолучитьКоллекцииQdrant
// Запрашивает список коллекций из Qdrant через API.
//
// Параметры:
//   КомпонентRAG  - Структура - данные RAG-компонента
//   ИмяКоллекции  - Строка   - если заполнено, возвращает только эту коллекцию
//
// Возвращаемое значение:
//   Массив Из Соответствие - описания коллекций из ответа Qdrant: с именем и статусом
//     для списка, с конфигурацией и числом точек для одной коллекции. Коллекции
//     с указанным именем нет — пустой массив. Другие ошибки Qdrant дают исключение.
Функция ПолучитьКоллекцииQdrant(КомпонентRAG, ИмяКоллекции = "") Экспорт

	МассивКоллекций = Новый Массив;

	Если ЗначениеЗаполнено(ИмяКоллекции) Тогда

		// GET /collections/{name} → { result: { status, points_count, config, ... } }
		Ответ = ВыполнитьЗапросQdrant(КомпонентRAG, "GET", "/collections/" + ИмяКоллекции);
		Если Ответ.КодСостояния = 404 Тогда
			Возврат МассивКоллекций;
		КонецЕсли;
		ПроверитьОтветСервиса("Qdrant", Ответ, СтрШаблон("чтение коллекции [%1]", ИмяКоллекции));

		ОписаниеКоллекции = ЗначениеПоля(Ответ.Данные, "result");
		Если ТипЗнч(ОписаниеКоллекции) = Тип("Соответствие") Тогда
			МассивКоллекций.Добавить(ОписаниеКоллекции);
		КонецЕсли;

	Иначе

		// GET /collections → { result: { collections: [ { name }, ... ] } }
		Ответ = ВыполнитьЗапросQdrant(КомпонентRAG, "GET", "/collections");
		ПроверитьОтветСервиса("Qdrant", Ответ, "чтение списка коллекций");

		Коллекции = ЗначениеПоля(ЗначениеПоля(Ответ.Данные, "result"), "collections");
		Если ТипЗнч(Коллекции) = Тип("Массив") Тогда
			Для Каждого Элемент Из Коллекции Цикл
				МассивКоллекций.Добавить(Элемент);
			КонецЦикла;
		КонецЕсли;

	КонецЕсли;

	Возврат МассивКоллекций;

КонецФункции

// ПолучитьВектор
// Отправляет текст в Embedding-сервис и возвращает вектор.
// Сервис должен поддерживать OpenAI Embeddings API:
//   POST /embeddings  { "model": "...", "input": "текст" }
//
// Параметры:
//   КомпонентRAG - Структура - данные RAG-компонента
//   Данные       - Строка    - текст для векторизации
//
// Возвращаемое значение:
//   Массив Из Число - вектор (embedding). Ошибка сервиса, пустой вектор или вектор
//   не того размера, что указан в подключении, дают исключение.
Функция ПолучитьВектор(КомпонентRAG, Данные) Экспорт

	Тело = Новый Структура;
	Тело.Вставить("model", КомпонентRAG.EmbeddingМодель);
	Тело.Вставить("input", Данные);

	Ответ = ВыполнитьЗапросEmbedding(КомпонентRAG, "POST", "/embeddings", Тело);
	ПроверитьОтветСервиса("Сервис эмбеддингов", Ответ, "получение вектора");

	// Ответ OpenAI Embeddings: { "data": [ { "embedding": [...], "index": 0 } ] }
	МассивData = ЗначениеПоля(Ответ.Данные, "data");
	Если ТипЗнч(МассивData) <> Тип("Массив") Или МассивData.Количество() = 0 Тогда
		ВызватьИсключение СтрШаблон(
			"Сервис эмбеддингов не вернул векторы в поле data. Ответ: %1",
			Лев(Ответ.Текст, 500));
	КонецЕсли;

	Вектор = ЗначениеПоля(МассивData[0], "embedding");
	Если ТипЗнч(Вектор) <> Тип("Массив") Или Вектор.Количество() = 0 Тогда
		ВызватьИсключение "Сервис эмбеддингов вернул пустой вектор.";
	КонецЕсли;

	// Вектор другого размера Qdrant тоже отвергнет, но с менее понятной ошибкой.
	Если ЗначениеЗаполнено(КомпонентRAG.EmbeddingРазмерность)
		И Вектор.Количество() <> КомпонентRAG.EmbeddingРазмерность Тогда
		ВызватьИсключение СтрШаблон(
			"Модель эмбеддингов [%1] вернула вектор размера %2, а в подключении RAG [%3] указан размер %4.",
			КомпонентRAG.EmbeddingМодель,
			Вектор.Количество(),
			КомпонентRAG.Наименование,
			КомпонентRAG.EmbeddingРазмерность);
	КонецЕсли;

	Возврат Вектор;

КонецФункции

// РазместитьВектор
// Низкоуровневая обёртка для upsert одного вектора в Qdrant.
// Для пакетной загрузки используйте ОтправитьДанныеВQdrant с массивом точек.
//
// Параметры:
//   КомпонентRAG - Структура  - данные RAG-компонента
//   ИмяКоллекции - Строка     - имя коллекции в Qdrant
//   Вектор       - Массив     - числовой вектор
//   Payload      - Структура  - произвольные метаданные точки (текст чанка, ссылка и т.д.)
//   ИдентификаторТочки - Строка - UUID точки (если не задан — генерируется)
//
// Возвращаемое значение:
//   Структура - { Успех: Булево, Описание: Строка }
Функция РазместитьВектор(КомпонентRAG, ИмяКоллекции, Вектор, Payload, ИдентификаторТочки = "") Экспорт

	Если Не ЗначениеЗаполнено(ИдентификаторТочки) Тогда
		// Qdrant принимает UUID или целое число в качестве id
		ИдентификаторТочки = Строка(Новый УникальныйИдентификатор);
	КонецЕсли;

	Точка = Новый Структура;
	Точка.Вставить("id",      ИдентификаторТочки);
	Точка.Вставить("vector",  Вектор);
	Точка.Вставить("payload", Payload);

	МассивТочек = Новый Массив;
	МассивТочек.Добавить(Точка);

	Возврат ОтправитьДанныеВQdrant(КомпонентRAG, ИмяКоллекции, МассивТочек);

КонецФункции

// ПостроитьФильтрПоАгенту
// Возвращает структуру filter для Qdrant по разрешениям агента
// (читает табличную часть AI_Агенты.RAGРазрешения).
//
// Возвращает Неопределено если у агента нет разрешений — фильтр не применяется,
// поиск идёт по всем чанкам (поведение по умолчанию).
//
// Маппинг типа разрешения → ключ payload Qdrant:
//   Организация → "org_guid"
//   Тенант      → "tenant"
//   Право       → "permissions"
//   ТипДанных   → "entity_type"
//
// Для типа Право в any-список автоматически добавляется "all" — обратная
// совместимость с чанками, помеченными как универсально доступные.
//
// Параметры:
//   Агент - СправочникСсылка.AI_Агенты
//
// Возвращаемое значение:
//   Структура с ключом must (массив условий) либо Неопределено
Функция ПостроитьФильтрПоАгенту(Агент) Экспорт

	Если НЕ ЗначениеЗаполнено(Агент) Тогда
		Возврат Неопределено;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Разрешения.Разрешение.ТипРазрешения  КАК ТипРазрешения,
		|	Разрешения.Разрешение.Наименование   КАК Значение
		|ИЗ
		|	Справочник.AI_Агенты.RAGРазрешения КАК Разрешения
		|ГДЕ
		|	Разрешения.Ссылка = &Агент";
	Запрос.УстановитьПараметр("Агент", Агент);

	Выборка = Запрос.Выполнить().Выбрать();

	// Группируем значения по ключу payload
	ПоКлючам = Новый Соответствие;
	Пока Выборка.Следующий() Цикл
		КлючPayload = КлючPayloadПоТипу(Выборка.ТипРазрешения);
		Если КлючPayload = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		Массив = ПоКлючам.Получить(КлючPayload);
		Если Массив = Неопределено Тогда
			Массив = Новый Массив;
			ПоКлючам.Вставить(КлючPayload, Массив);
		КонецЕсли;
		Массив.Добавить(Строка(Выборка.Значение));
	КонецЦикла;

	// Авто-добавление "all" для permissions — обратная совместимость
	ПраваМассив = ПоКлючам.Получить("permissions");
	Если ПраваМассив <> Неопределено И ПраваМассив.Найти("all") = Неопределено Тогда
		ПраваМассив.Добавить("all");
	КонецЕсли;

	Если ПоКлючам.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;

	Must = Новый Массив;
	Для Каждого КЗ Из ПоКлючам Цикл
		Условие = Новый Структура;
		Условие.Вставить("key",   КЗ.Ключ);
		Условие.Вставить("match", Новый Структура("any", КЗ.Значение));
		Must.Добавить(Условие);
	КонецЦикла;

	Возврат Новый Структура("must", Must);

КонецФункции

// Соответствие значения перечисления AI_ТипыРазрешенийRAG ключу payload Qdrant.
Функция КлючPayloadПоТипу(ТипРазрешения) Экспорт
	Если ТипРазрешения = Перечисления.AI_ТипыРазрешенийRAG.Организация Тогда
		Возврат "org_guid";
	ИначеЕсли ТипРазрешения = Перечисления.AI_ТипыРазрешенийRAG.Тенант Тогда
		Возврат "tenant";
	ИначеЕсли ТипРазрешения = Перечисления.AI_ТипыРазрешенийRAG.Право Тогда
		Возврат "permissions";
	ИначеЕсли ТипРазрешения = Перечисления.AI_ТипыРазрешенийRAG.ТипДанных Тогда
		Возврат "entity_type";
	КонецЕсли;
	Возврат Неопределено;
КонецФункции

// ПоискПохожихВQdrant
// Выполняет векторный поиск в коллекции Qdrant.
// Используется из AI_Клиент.ОбработатьВекторныйЗапрос().
//
// Параметры:
//   КомпонентRAG        - Структура - данные RAG-компонента
//   ИмяКоллекции        - Строка    - имя коллекции
//   Вектор              - Массив    - вектор запроса
//   Лимит               - Число     - максимальное количество результатов
//   МинПорогСхожести    - Число     - минимальный score (0..1)
//   Фильтр              - Структура - filter для Qdrant (см. ПостроитьФильтрПоАгенту)
//                                     или Неопределено = без фильтра
//
// Возвращаемое значение:
//   Массив Из Соответствие - точки { id, score, payload }; payload тоже соответствие:
//   ключи payload в Qdrant произвольные и не всегда годятся в ключи структуры.
//   Ошибка Qdrant дает исключение с его сообщением.
Функция ПоискПохожихВQdrant(КомпонентRAG, ИмяКоллекции, Вектор, Лимит = 5,
                            МинПорогСхожести = 0.7, Фильтр = Неопределено) Экспорт

	// Лимит 0 — из коллекции ничего не брать; Qdrant такой лимит отвергает.
	Если Не ЗначениеЗаполнено(Лимит) Или Лимит <= 0 Тогда
		Возврат Новый Массив;
	КонецЕсли;

	Тело = Новый Структура;
	Тело.Вставить("vector",          Вектор);
	Тело.Вставить("limit",           Лимит);
	Тело.Вставить("with_payload",    Истина);

	// Порог 0 — без порога: косинусное сходство бывает и отрицательным.
	Если ЗначениеЗаполнено(МинПорогСхожести) И МинПорогСхожести > 0 Тогда
		Тело.Вставить("score_threshold", МинПорогСхожести);
	КонецЕсли;

	Если Фильтр <> Неопределено Тогда
		Тело.Вставить("filter", Фильтр);
	КонецЕсли;

	Ответ = ВыполнитьЗапросQdrant(КомпонентRAG, "POST",
		СтрШаблон("/collections/%1/points/search", ИмяКоллекции), Тело);
	ПроверитьОтветСервиса("Qdrant", Ответ, СтрШаблон("поиск в коллекции [%1]", ИмяКоллекции));

	// { "result": [ { "id": ..., "score": ..., "payload": {...} }, ... ] }
	РезультатыПоиска = ЗначениеПоля(Ответ.Данные, "result");
	Если ТипЗнч(РезультатыПоиска) <> Тип("Массив") Тогда
		Возврат Новый Массив;
	КонецЕсли;

	Возврат РезультатыПоиска;

КонецФункции

// ОбработатьПорциюВекторизации
// Вызывается фоновым заданием для одной порции (одна коллекция).
// Получает данные из AI_ОчередьВекторизации, строит векторы, отправляет в Qdrant,
// фиксирует в AI_ИдентификаторыЧанков, удаляет из очереди.
//
// Параметры:
//   ПараметрЗадания - Структура - { Коллекция, МассивИдентификаторов }
Процедура ОбработатьПорциюВекторизации(ПараметрЗадания) Экспорт

	Коллекция            = ПараметрЗадания.Коллекция;
	МассивИдентификаторов = ПараметрЗадания.МассивИдентификаторов;

	// 1. Получаем данные коллекции и компонента RAG
	ДанныеКоллекцийСоответствие = Справочники.AI_RAGКоллекции.ПолучитьЗначенияКоллекций(Коллекция);
	ДанныеКоллекции = ДанныеКоллекцийСоответствие[Коллекция];

	// КомпонентRAG — владелец коллекции (Справочник.AI_RAG)
	КомпонентRAGСсылка = ДанныеКоллекции.Ссылка.Владелец;
	КомпонентRAG       = ПолучитьСтруктуруКомпонентаRAG(КомпонентRAGСсылка);

	ИмяКоллекции = ДанныеКоллекции.Наименование;

	// 2. Коллекция должна быть в Qdrant и отмечена созданной: отсутствующая
	// создается, созданная вне 1С только отмечается.
	РезИниц = ИнициализироватьКоллекциюВQdrant(Коллекция, КомпонентRAG);
	Если Не РезИниц.Успех Тогда
		ВызватьИсключение СтрШаблон(
			"Не удалось инициализировать коллекцию [%1] в Qdrant: %2",
			ИмяКоллекции, РезИниц.Описание);
	КонецЕсли;

	// 3. Читаем данные записей очереди
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Очередь.УникальныйИдентификатор     КАК УникальныйИдентификатор,
		|	Очередь.ИдентификаторЧанка           КАК ИдентификаторЧанка,
		|	Очередь.ИдентификаторСущности        КАК ИдентификаторСущности,
		|	Очередь.ЗаголовокЧанка               КАК ЗаголовокЧанка,
		|	Очередь.Подзаголовок                 КАК Подзаголовок,
		|	Очередь.ПодзаголовокВторогоУровня    КАК ПодзаголовокВторогоУровня,
		|	Очередь.Данные                       КАК Данные,
		|	Очередь.КонтекстТекст                КАК КонтекстТекст,
		|	Очередь.ОтображаемыйТекст            КАК ОтображаемыйТекст,
		|	Очередь.ХешДанных                    КАК ХешДанных,
		|	Очередь.НомерЧанка                   КАК НомерЧанка,
		|	Очередь.ВсегоЧанков                  КАК ВсегоЧанков,
		|	Очередь.Секция                       КАК Секция,
		|	Очередь.ИсточникВнутреннийТип        КАК ИсточникВнутреннийТип,
		|	Очередь.НавигационнаяСсылка          КАК НавигационнаяСсылка,
		|	Очередь.Разрешения                   КАК Разрешения,
		|	Очередь.Тенант                       КАК Тенант,
		|	Очередь.ОрганизацияИГуид             КАК ОрганизацияИГуид,
		|	Очередь.Язык                         КАК Язык,
		|	Очередь.Источник                     КАК Источник
		|ИЗ
		|	РегистрСведений.AI_ОчередьВекторизации КАК Очередь
		|ГДЕ
		|	Очередь.УникальныйИдентификатор В (&МассивИдентификаторов)";

	Запрос.УстановитьПараметр("МассивИдентификаторов", МассивИдентификаторов);
	Выборка = Запрос.Выполнить().Выбрать();

	// 4. Строим точки пакетами по 50 штук — не перегружаем Embedding-сервис
	РазмерПорции = 50;
	МассивТочек  = Новый Массив;
	ОбработанныеИдентификаторы = Новый Массив;

	// Отслеживаем актуальные ID чанков по сущностям для последующей чистки сирот.
	// Ключ = НавигационнаяСсылка + "|" + ТипСущности
	ТекущиеЧанкиПоСущностям = Новый Соответствие;

	Пока Выборка.Следующий() Цикл

		// 4а. Проверяем хеш — если данные не изменились, пропускаем
		Если ХешНеИзменился(Выборка.НавигационнаяСсылка, Выборка.ИсточникВнутреннийТип,
		                     Выборка.НомерЧанка, Выборка.ИдентификаторЧанка, Выборка.ХешДанных) Тогда
			// Чанк не изменился — фиксируем как актуальный (сиротой не является)
			ДобавитьАктуальныйЧанк(ТекущиеЧанкиПоСущностям,
				Выборка.НавигационнаяСсылка, Выборка.ИсточникВнутреннийТип, Выборка.ИдентификаторЧанка);
			// Удаляем из очереди без повторной векторизации
			УдалитьЗаписьИзОчереди(Выборка.УникальныйИдентификатор);
			Продолжить;
		КонецЕсли;

		// 4б. Получаем вектор
		Вектор = ПолучитьВектор(КомпонентRAG, Выборка.Данные);

		// 4в. Строим payload для Qdrant — всё что пригодится при поиске
		Payload = Новый Структура;
		Payload.Вставить("text",          Выборка.КонтекстТекст);    // текст для LLM
		Payload.Вставить("display_text",  Выборка.ОтображаемыйТекст); // текст для UI
		Payload.Вставить("header",        Выборка.ЗаголовокЧанка);
		Payload.Вставить("subheader",     Выборка.Подзаголовок);
		Payload.Вставить("subheader2",    Выборка.ПодзаголовокВторогоУровня);
		Payload.Вставить("section",       Выборка.Секция);
		Payload.Вставить("chunk_num",     Выборка.НомерЧанка);
		Payload.Вставить("chunks_total",  Выборка.ВсегоЧанков);
		Payload.Вставить("entity_id",     Выборка.ИдентификаторСущности);
		Payload.Вставить("entity_type",   Выборка.ИсточникВнутреннийТип);
		Payload.Вставить("nav_ref",       Выборка.НавигационнаяСсылка);
		Payload.Вставить("source",        Выборка.Источник);
		Payload.Вставить("tenant",        Выборка.Тенант);
		Payload.Вставить("org_guid",      Выборка.ОрганизацияИГуид);
		Payload.Вставить("lang",          Выборка.Язык);
		Payload.Вставить("permissions",   Выборка.Разрешения);

		// 4г. Формируем точку — id берём из ИдентификаторЧанка (UUID)
		Точка = Новый Структура;
		Точка.Вставить("id",      Строка(Выборка.ИдентификаторЧанка));
		Точка.Вставить("vector",  Вектор);
		Точка.Вставить("payload", Payload);
		МассивТочек.Добавить(Точка);

		// Фиксируем как актуальный (новая или обновлённая версия чанка)
		ДобавитьАктуальныйЧанк(ТекущиеЧанкиПоСущностям,
			Выборка.НавигационнаяСсылка, Выборка.ИсточникВнутреннийТип, Выборка.ИдентификаторЧанка);

		// Запоминаем для последующей фиксации
		ОбработанныеИдентификаторы.Добавить(Новый Структура(
			"УникальныйИдентификатор, ИдентификаторЧанка, НавигационнаяСсылка,
			|ИсточникВнутреннийТип, НомерЧанка, ХешДанных, Вектор",
			Выборка.УникальныйИдентификатор,
			Выборка.ИдентификаторЧанка,
			Выборка.НавигационнаяСсылка,
			Выборка.ИсточникВнутреннийТип,
			Выборка.НомерЧанка,
			Выборка.ХешДанных,
			OPI_Инструменты.JSONСтрокой(Вектор, , Ложь, Ложь)));

		// 4д. Отправляем порцию и сбрасываем накопитель
		Если МассивТочек.Количество() >= РазмерПорции Тогда
			ОтправитьПорциюВQdrant(КомпонентRAG, ИмяКоллекции, МассивТочек, ОбработанныеИдентификаторы);
			МассивТочек = Новый Массив;
			ОбработанныеИдентификаторы = Новый Массив;
		КонецЕсли;

	КонецЦикла;

	// 4е. Отправляем остаток (хвост менее 50 записей)
	Если МассивТочек.Количество() > 0 Тогда
		ОтправитьПорциюВQdrant(КомпонентRAG, ИмяКоллекции, МассивТочек, ОбработанныеИдентификаторы);
	КонецЕсли;

	// 5. Удаляем устаревшие (сиротские) чанки для всех обработанных сущностей.
	// Вызывается после того как все порции отправлены — новые ID уже в Qdrant.
	Для Каждого КЗ Из ТекущиеЧанкиПоСущностям Цикл
		УдалитьСтарыеЧанкиСущности(КомпонентRAG, ИмяКоллекции,
			КЗ.Значение.НавигационнаяСсылка, КЗ.Значение.ТипСущности, КЗ.Значение.МассивID);
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Dispatch подготовки к векторизации по типу ссылок.
// Изолированное расширение не сериализует произвольные объекты автоматически:
// состав индексируемых полей должен быть явно задан в проекте внедрения.
// Сборщик типа, который пишет проект внедрения, для каждой ссылки:
//   - находит коллекции типа: Справочники.AI_RAGКоллекции.ПолучитьКоллекцииПоПредставлениюТипа;
//   - собирает текст фрагментов и кладет их в очередь векторизации:
//     РегистрыСведений.AI_ОчередьВекторизации.ПолучитьПараметрыЭлемента и ЗаписатьЭлементВекторизации;
//   - в той же транзакции убирает ссылку из очереди подготовки:
//     РегистрыСведений.AI_ОчередьПодготовкиКВекторизации.УдалитьСсылкуИзОчереди.
// Сама эта процедура ссылки из очереди не удаляет.
Процедура ОбработкаМассиваОчередиПодготовкиПоТипу(МассивСсылок, ТипСсылок)

	ТекстОшибки = СтрШаблон(
		"AI_RAG: сборщик данных типа [%1] не настроен. "
			+ "Добавьте явную обработку типа перед постановкой объектов в очередь.",
		ТипСсылок);
	ЗаписьЖурналаРегистрации(
		"AI_RAG",
		УровеньЖурналаРегистрации.Ошибка, , ,
		ТекстОшибки);
	ВызватьИсключение ТекстОшибки;

КонецПроцедуры

// Подключения RAG по настройкам коллекций из временной таблицы ВТНастройкиКоллекций,
// которую помещает первый запрос пакета. Строки группируются по подключению в коде:
// в итогах без агрегатных функций поля подключения были бы NULL.
Функция ДанныеRAGПоВременнойТаблице(Запрос)

	Запрос.Текст = Запрос.Текст + "
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Настройки.Коллекция КАК Коллекция,
		|	Коллекции.Наименование КАК ИмяКоллекции,
		|	Коллекции.ТипКоллекции КАК ТипКоллекции,
		|	Коллекции.КоллекцияИнициализирована КАК КоллекцияИнициализирована,
		|	Настройки.ЛимитФрагментовQdrant КАК ЛимитФрагментовQdrant,
		|	Настройки.ВесКоллекции КАК ВесКоллекции,
		|	Настройки.МинПорогСхожестиВектора КАК МинПорогСхожестиВектора,
		|	Подключения.Ссылка КАК КомпонентRAG,
		|	Подключения.Наименование КАК Наименование,
		|	Подключения.Активен КАК Активен,
		|	Подключения.EmbeddingURL КАК EmbeddingURL,
		|	Подключения.EmbeddingМодель КАК EmbeddingМодель,
		|	Подключения.EmbeddingРазмерность КАК EmbeddingРазмерность,
		|	Подключения.EmbeddingТаймаутСек КАК EmbeddingТаймаутСек,
		|	Подключения.EmbeddingAPIКлюч КАК EmbeddingAPIКлюч,
		|	Подключения.QdrantURL КАК QdrantURL,
		|	Подключения.QdrantТаймаутСек КАК QdrantТаймаутСек,
		|	Подключения.QdrantAPIКлюч КАК QdrantAPIКлюч
		|ИЗ
		|	ВТНастройкиКоллекций КАК Настройки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.AI_RAGКоллекции КАК Коллекции
		|		ПО Настройки.Коллекция = Коллекции.Ссылка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.AI_RAG КАК Подключения
		|		ПО (Коллекции.Владелец = Подключения.Ссылка)
		|ГДЕ
		|	Настройки.Использовать
		|	И Настройки.ЛимитФрагментовQdrant > 0
		|
		|УПОРЯДОЧИТЬ ПО
		|	Подключения.Наименование,
		|	ИмяКоллекции";

	Выборка = Запрос.ВыполнитьПакет()[1].Выбрать();

	ДанныеRAG = Новый Массив;
	КомпонентыПоСсылке = Новый Соответствие;
	ВключенныеКоллекции = Новый Соответствие;

	Пока Выборка.Следующий() Цикл

		Если Не Выборка.Активен Тогда
			ВызватьИсключение СтрШаблон(
				"Компонент RAG [%1] не активен. Продолжение невозможно.",
				Выборка.Наименование);
		КонецЕсли;

		Если Не Выборка.КоллекцияИнициализирована Тогда
			ВызватьИсключение СтрШаблон(
				"Коллекция [%2] подключения RAG [%1] не отмечена флажком «Создана в Qdrant». "
					+ "Флажок ставит векторизация коллекции; коллекцию, созданную вне 1С, "
					+ "отметьте в ее карточке.",
				Выборка.Наименование,
				Выборка.ИмяКоллекции);
		КонецЕсли;

		// Коллекция из нескольких строк ищется один раз, иначе фрагменты задвоятся.
		Если ВключенныеКоллекции.Получить(Выборка.Коллекция) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		ВключенныеКоллекции.Вставить(Выборка.Коллекция, Истина);

		КомпонентRAG = КомпонентыПоСсылке.Получить(Выборка.КомпонентRAG);
		Если КомпонентRAG = Неопределено Тогда
			КомпонентRAG = НовыйКомпонентRAG(Выборка);
			КомпонентRAG.Вставить("МассивКоллекций", Новый Массив);
			КомпонентыПоСсылке.Вставить(Выборка.КомпонентRAG, КомпонентRAG);
			ДанныеRAG.Добавить(КомпонентRAG);
		КонецЕсли;

		ОписаниеКоллекции = Новый Структура;
		ОписаниеКоллекции.Вставить("Коллекция",               Выборка.Коллекция);
		ОписаниеКоллекции.Вставить("ИмяКоллекции",            Выборка.ИмяКоллекции);
		ОписаниеКоллекции.Вставить("ТипКоллекции",            Выборка.ТипКоллекции);
		ОписаниеКоллекции.Вставить("ЛимитФрагментовQdrant",   Выборка.ЛимитФрагментовQdrant);
		ОписаниеКоллекции.Вставить("ВесКоллекции",            Выборка.ВесКоллекции);
		ОписаниеКоллекции.Вставить("МинПорогСхожестиВектора", Выборка.МинПорогСхожестиВектора);
		КомпонентRAG.МассивКоллекций.Добавить(ОписаниеКоллекции);

	КонецЦикла;

	Возврат ДанныеRAG;

КонецФункции

// Поля подключения RAG, нужные для запросов к сервисам.
// Данные - выборка или строка с полями справочника AI_RAG под этими же именами.
Функция НовыйКомпонентRAG(Данные)

	КомпонентRAG = Новый Структура;
	КомпонентRAG.Вставить("КомпонентRAG",         Данные.КомпонентRAG);
	КомпонентRAG.Вставить("Наименование",         Данные.Наименование);
	КомпонентRAG.Вставить("Активен",              Данные.Активен);
	КомпонентRAG.Вставить("EmbeddingURL",         Данные.EmbeddingURL);
	КомпонентRAG.Вставить("EmbeddingМодель",      Данные.EmbeddingМодель);
	КомпонентRAG.Вставить("EmbeddingРазмерность", Данные.EmbeddingРазмерность);
	КомпонентRAG.Вставить("EmbeddingТаймаутСек",  Данные.EmbeddingТаймаутСек);
	КомпонентRAG.Вставить("EmbeddingAPIКлюч",     Данные.EmbeddingAPIКлюч);
	КомпонентRAG.Вставить("QdrantURL",            Данные.QdrantURL);
	КомпонентRAG.Вставить("QdrantТаймаутСек",     Данные.QdrantТаймаутСек);
	КомпонентRAG.Вставить("QdrantAPIКлюч",        Данные.QdrantAPIКлюч);
	Возврат КомпонентRAG;

КонецФункции

// Есть ли коллекция в Qdrant и какого размера в ней векторы
// (0 — размер неизвестен, например у коллекции с именованными векторами).
Функция СостояниеКоллекцииQdrant(КомпонентRAG, ИмяКоллекции)

	Состояние = Новый Структура("Существует, РазмерВектора", Ложь, 0);

	Коллекции = ПолучитьКоллекцииQdrant(КомпонентRAG, ИмяКоллекции);
	Если Коллекции.Количество() = 0 Тогда
		Возврат Состояние;
	КонецЕсли;

	Состояние.Существует = Истина;
	Векторы = ЗначениеПоля(ЗначениеПоля(ЗначениеПоля(Коллекции[0], "config"), "params"), "vectors");
	РазмерВектора = ЗначениеПоля(Векторы, "size");
	Если ТипЗнч(РазмерВектора) = Тип("Число") Тогда
		Состояние.РазмерВектора = РазмерВектора;
	КонецЕсли;

	Возврат Состояние;

КонецФункции

Процедура СоздатьКоллекциюQdrant(КомпонентRAG, ИмяКоллекции)

	Если Не ЗначениеЗаполнено(КомпонентRAG.EmbeddingРазмерность) Тогда
		ВызватьИсключение СтрШаблон(
			"В подключении RAG [%1] не указан размер вектора: коллекцию [%2] в Qdrant не создать.",
			КомпонентRAG.Наименование,
			ИмяКоллекции);
	КонецЕсли;

	ВекторыПараметры = Новый Структура;
	ВекторыПараметры.Вставить("size",     КомпонентRAG.EmbeddingРазмерность);
	ВекторыПараметры.Вставить("distance", "Cosine");
	ТелоЗапроса = Новый Структура("vectors", ВекторыПараметры);

	// PUT /collections/{name}. 409 — коллекцию уже создали, например параллельной
	// векторизацией; это не ошибка.
	Ответ = ВыполнитьЗапросQdrant(КомпонентRAG, "PUT", "/collections/" + ИмяКоллекции, ТелоЗапроса);
	Если Ответ.КодСостояния <> 409 Тогда
		ПроверитьОтветСервиса("Qdrant", Ответ, СтрШаблон("создание коллекции [%1]", ИмяКоллекции));
	КонецЕсли;

КонецПроцедуры

Процедура ОтметитьКоллекциюИнициализированной(Коллекция)

	Если Коллекция.КоллекцияИнициализирована Тогда
		Возврат;
	КонецЕсли;

	ОбъектКоллекции = Коллекция.ПолучитьОбъект();
	ОбъектКоллекции.КоллекцияИнициализирована = Истина;
	ОбъектКоллекции.Записать();

КонецПроцедуры

Функция ВыполнитьЗапросEmbedding(КомпонентRAG, Метод, Путь, Тело = Неопределено)

	Возврат ВыполнитьЗапросКСервису(
		"Сервис эмбеддингов",
		Метод,
		АдресСервисаRAG("Сервис эмбеддингов", КомпонентRAG.Наименование, КомпонентRAG.EmbeddingURL, Путь),
		ЗаголовкиEmbedding(КомпонентRAG.EmbeddingAPIКлюч),
		ТаймаутСервисаRAG(КомпонентRAG.EmbeddingТаймаутСек),
		Тело);

КонецФункции

Функция ВыполнитьЗапросQdrant(КомпонентRAG, Метод, Путь, Тело = Неопределено)

	Возврат ВыполнитьЗапросКСервису(
		"Qdrant",
		Метод,
		АдресСервисаRAG("Qdrant", КомпонентRAG.Наименование, КомпонентRAG.QdrantURL, Путь),
		ЗаголовкиQdrant(КомпонентRAG.QdrantAPIКлюч),
		ТаймаутСервисаRAG(КомпонентRAG.QdrantТаймаутСек),
		Тело);

КонецФункции

// Запрос к сервису эмбеддингов или Qdrant с таймаутом подключения и без повторов:
// сбой виден сразу, а регламентная векторизация повторит порцию при следующем
// запуске. Нет ответа (сбой соединения, таймаут) — исключение.
//
// Возвращаемое значение:
//   Структура - КодСостояния - Число;
//               Текст        - Строка - тело ответа;
//               Данные       - Соответствие, Массив, Неопределено - тело, разобранное как JSON.
Функция ВыполнитьЗапросКСервису(ИмяСервиса, Метод, URL, Заголовки, ТаймаутСекунд, Тело)

	HTTPКлиент = OPI_ЗапросыHTTP.НовыйЗапрос()
		.Инициализировать(URL)
		.УстановитьТаймаут(ТаймаутСекунд)
		.МаксимумПопыток(0)
		.УстановитьЗаголовки(Заголовки);
	Если Тело <> Неопределено Тогда
		HTTPКлиент.УстановитьJsonТело(Тело);
	КонецЕсли;
	HTTPКлиент.ОбработатьЗапрос(Метод);

	Попытка
		КодСостояния = HTTPКлиент.ВернутьОтвет(Ложь, Истина).КодСостояния;
	Исключение
		ВызватьИсключение СтрШаблон(
			"%1 не ответил (%2 %3, таймаут %4 с): %5",
			ИмяСервиса,
			Метод,
			URL,
			ТаймаутСекунд,
			ПричинаСбояHTTP(ОписаниеОшибки()));
	КонецПопытки;

	// Тело читает сам клиент: он распаковывает ответ, сжатый gzip.
	ДвоичноеТело = HTTPКлиент.ВернутьОтветКакДвоичныеДанные(Ложь, Истина);
	Текст = "";
	Если ТипЗнч(ДвоичноеТело) = Тип("ДвоичныеДанные") И ДвоичноеТело.Размер() > 0 Тогда
		Текст = ПолучитьСтрокуИзДвоичныхДанных(ДвоичноеТело, КодировкаТекста.UTF8);
	КонецЕсли;

	Данные = Неопределено;
	Если ЗначениеЗаполнено(Текст) Тогда
		Попытка
			ЧтениеJSON = Новый ЧтениеJSON;
			ЧтениеJSON.УстановитьСтроку(Текст);
			Данные = ПрочитатьJSON(ЧтениеJSON, Истина);
			ЧтениеJSON.Закрыть();
		Исключение
			// Не JSON, например текстовый ответ healthz Qdrant
			Данные = Неопределено;
		КонецПопытки;
	КонецЕсли;

	Возврат Новый Структура("КодСостояния, Текст, Данные", КодСостояния, Текст, Данные);

КонецФункции

// Адрес метода: адрес сервиса из подключения без «/» на конце плюс путь.
Функция АдресСервисаRAG(ИмяСервиса, ИмяПодключения, АдресСервиса, Путь)

	Адрес = СокрЛП(АдресСервиса);
	Пока СтрЗаканчиваетсяНа(Адрес, "/") Цикл
		Адрес = Лев(Адрес, СтрДлина(Адрес) - 1);
	КонецЦикла;

	Если Не ЗначениеЗаполнено(Адрес) Тогда
		ВызватьИсключение СтрШаблон(
			"%1: в подключении RAG [%2] не заполнен адрес.",
			ИмяСервиса,
			ИмяПодключения);
	КонецЕсли;

	Возврат Адрес + Путь;

КонецФункции

// Таймаут из подключения; 0 — 30 секунд. Без него HTTP-клиент ждет ответа до часа.
Функция ТаймаутСервисаRAG(ТаймаутСекунд)

	Если ТипЗнч(ТаймаутСекунд) = Тип("Число") И ТаймаутСекунд > 0 Тогда
		Возврат ТаймаутСекунд;
	КонецЕсли;
	Возврат 30;

КонецФункции

// Из журнала HTTP-клиента — строка с причиной сбоя, остальное служебное.
Функция ПричинаСбояHTTP(ТекстОшибки)

	Маркер = "внутренняя ошибка - ";
	Позиция = СтрНайти(ТекстОшибки, Маркер);
	Если Позиция = 0 Тогда
		Возврат ТекстОшибки;
	КонецЕсли;

	Причина = Сред(ТекстОшибки, Позиция + СтрДлина(Маркер));
	КонецСтроки = СтрНайти(Причина, Символы.ПС);
	Если КонецСтроки > 0 Тогда
		Причина = Лев(Причина, КонецСтроки - 1);
	КонецЕсли;
	Возврат СокрЛП(Причина);

КонецФункции

// Ответ с кодом вне 2xx или с полем error — исключение с сообщением сервиса.
Процедура ПроверитьОтветСервиса(ИмяСервиса, Ответ, Действие)

	Если Ответ.КодСостояния >= 200 И Ответ.КодСостояния < 300
		И ЗначениеПоля(Ответ.Данные, "error") = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ВызватьИсключение СтрШаблон(
		"%1: %2 — HTTP %3: %4",
		ИмяСервиса,
		Действие,
		Ответ.КодСостояния,
		СообщениеОбОшибкеСервиса(Ответ));

КонецПроцедуры

// Qdrant кладет текст ошибки в status.error, OpenAI-совместимые сервисы —
// в error.message, error или detail.
Функция СообщениеОбОшибкеСервиса(Ответ)

	Статус = ЗначениеПоля(Ответ.Данные, "status");
	Ошибка = ЗначениеПоля(Ответ.Данные, "error");
	Подробности = ЗначениеПоля(Ответ.Данные, "detail");

	Если ЗначениеПоля(Статус, "error") <> Неопределено Тогда
		Сообщение = ЗначениеПоля(Статус, "error");
	ИначеЕсли ЗначениеПоля(Ошибка, "message") <> Неопределено Тогда
		Сообщение = ЗначениеПоля(Ошибка, "message");
	ИначеЕсли Ошибка <> Неопределено Тогда
		Сообщение = Ошибка;
	ИначеЕсли Подробности <> Неопределено Тогда
		Сообщение = Подробности;
	Иначе
		Возврат Лев(Ответ.Текст, 500);
	КонецЕсли;

	Если ТипЗнч(Сообщение) = Тип("Строка") Тогда
		Возврат Сообщение;
	КонецЕсли;
	Возврат OPI_Инструменты.JSONСтрокой(Сообщение, , Ложь);

КонецФункции

// Поле разобранного JSON-объекта; Неопределено, если поля нет или значение не объект.
Функция ЗначениеПоля(Данные, Ключ)

	Если ТипЗнч(Данные) = Тип("Соответствие") Тогда
		Возврат Данные.Получить(Ключ);
	КонецЕсли;
	Возврат Неопределено;

КонецФункции

// ЗаголовкиEmbedding
// Формирует заголовки для запросов к Embedding-сервису (OpenAI-совместимый).
Функция ЗаголовкиEmbedding(APIКлюч)

	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Content-Type", "application/json");

	Если ЗначениеЗаполнено(APIКлюч) Тогда
		Заголовки.Вставить("Authorization", "Bearer " + APIКлюч);
	КонецЕсли;

	Возврат Заголовки;

КонецФункции

// ЗаголовкиQdrant
// Формирует заголовки для запросов к Qdrant.
Функция ЗаголовкиQdrant(APIКлюч)

	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Content-Type", "application/json");

	Если ЗначениеЗаполнено(APIКлюч) Тогда
		// Qdrant использует api-key заголовок
		Заголовки.Вставить("api-key", APIКлюч);
	КонецЕсли;

	Возврат Заголовки;

КонецФункции

// НовыйРезультатОперации
// Вспомогательная фабрика для возврата унифицированного результата.
Функция НовыйРезультатОперации()

	Результат = Новый Структура;
	Результат.Вставить("Успех",    Ложь);
	Результат.Вставить("Описание", "");
	Возврат Результат;

КонецФункции

// ОтправитьПорциюВQdrant
// Отправляет накопленный массив точек в Qdrant, затем фиксирует результат
// в AI_ИдентификаторыЧанков и удаляет записи из AI_ОчередьВекторизации.
Процедура ОтправитьПорциюВQdrant(КомпонентRAG, ИмяКоллекции, МассивТочек, ОбработанныеИдентификаторы)

	Результат = ОтправитьДанныеВQdrant(КомпонентRAG, ИмяКоллекции, МассивТочек);

	Если Не Результат.Успех Тогда
		// Логируем ошибку — не прерываем всю очередь, оставляем записи на следующий запуск РЗ
		ЗаписьЖурналаРегистрации(
			"AI_RAG.Векторизация",
			УровеньЖурналаРегистрации.Ошибка,
			,
			,
			СтрШаблон("Ошибка отправки в Qdrant [%1]: %2", ИмяКоллекции, Результат.Описание));
		Возврат;
	КонецЕсли;

	// Фиксируем успешно отправленные чанки
	Для Каждого Запись Из ОбработанныеИдентификаторы Цикл

		НачатьТранзакцию();
		Попытка

			// Обновляем/создаём запись в AI_ИдентификаторыЧанков
			ЗафиксироватьИдентификаторЧанка(Запись);

			// Удаляем из очереди
			УдалитьЗаписьИзОчереди(Запись.УникальныйИдентификатор);

			ЗафиксироватьТранзакцию();

		Исключение
			ОтменитьТранзакцию();
			ЗаписьЖурналаРегистрации(
				"AI_RAG.Векторизация",
				УровеньЖурналаРегистрации.Ошибка,
				,
				,
				СтрШаблон("Ошибка фиксации чанка [%1]: %2",
					Запись.ИдентификаторЧанка, ОписаниеОшибки()));
		КонецПопытки;

	КонецЦикла;

КонецПроцедуры

// ЗафиксироватьИдентификаторЧанка
// Записывает или обновляет строку в AI_ИдентификаторыЧанков.
// Измерения: НавигационнаяСсылка + ТипСущности + НомерЧанка + ИдентификаторЧанка + ХешДанных
// Реквизиты: Вектор (JSON-строка), ХэшДанных (дублирует для быстрой проверки)
// Хеш входит в измерения, поэтому набор отбирается без него: запись прежней
// редакции фрагмента заменяется, а не остается рядом с новой.
Процедура ЗафиксироватьИдентификаторЧанка(Запись)

	НаборЗаписей = РегистрыСведений.AI_ИдентификаторыЧанков.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.НавигационнаяСсылка.Установить(Запись.НавигационнаяСсылка);
	НаборЗаписей.Отбор.ТипСущности.Установить(Запись.ИсточникВнутреннийТип);
	НаборЗаписей.Отбор.НомерЧанка.Установить(Запись.НомерЧанка);
	НаборЗаписей.Отбор.ИдентификаторЧанка.Установить(Запись.ИдентификаторЧанка);

	НоваяЗапись = НаборЗаписей.Добавить();

	// Измерения (ключ записи)
	НоваяЗапись.НавигационнаяСсылка = Запись.НавигационнаяСсылка;
	НоваяЗапись.ТипСущности          = Запись.ИсточникВнутреннийТип;
	НоваяЗапись.НомерЧанка           = Запись.НомерЧанка;
	НоваяЗапись.ИдентификаторЧанка   = Запись.ИдентификаторЧанка;
	НоваяЗапись.ХешДанных            = Запись.ХешДанных;

	// Реквизиты
	НоваяЗапись.Вектор    = Запись.Вектор;    // JSON-строка вектора — для кеша
	НоваяЗапись.ХэшДанных = Запись.ХешДанных; // Дублируем для запросов без соединения

	НаборЗаписей.Записать(Истина);

КонецПроцедуры

// ХешНеИзменился
// Проверяет: есть ли в AI_ИдентификаторыЧанков запись с таким же хешем.
// Если есть — данные не изменились, повторная векторизация не нужна.
//
// Возвращаемое значение: Булево
Функция ХешНеИзменился(НавигационнаяСсылка, ТипСущности, НомерЧанка, ИдентификаторЧанка, ХешДанных)

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	1 КАК Признак
		|ИЗ
		|	РегистрСведений.AI_ИдентификаторыЧанков КАК ИдЧанков
		|ГДЕ
		|	ИдЧанков.НавигационнаяСсылка = &НавигационнаяСсылка
		|	И ИдЧанков.ТипСущности        = &ТипСущности
		|	И ИдЧанков.НомерЧанка         = &НомерЧанка
		|	И ИдЧанков.ИдентификаторЧанка = &ИдентификаторЧанка
		|	И ИдЧанков.ХешДанных          = &ХешДанных";

	Запрос.УстановитьПараметр("НавигационнаяСсылка", НавигационнаяСсылка);
	Запрос.УстановитьПараметр("ТипСущности",          ТипСущности);
	Запрос.УстановитьПараметр("НомерЧанка",           НомерЧанка);
	Запрос.УстановитьПараметр("ИдентификаторЧанка",   ИдентификаторЧанка);
	Запрос.УстановитьПараметр("ХешДанных",            ХешДанных);

	Возврат Не Запрос.Выполнить().Пустой();

КонецФункции

// УдалитьЗаписьИзОчереди
// Удаляет одну запись из AI_ОчередьВекторизации по УникальномуИдентификатору.
Процедура УдалитьЗаписьИзОчереди(УникальныйИдентификатор)

	НаборЗаписей = РегистрыСведений.AI_ОчередьВекторизации.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.УникальныйИдентификатор.Установить(УникальныйИдентификатор);
	НаборЗаписей.Записать(Истина); // Пустой набор = удаление записи

КонецПроцедуры

// ПолучитьСтруктуруКомпонентаRAG
// Читает реквизиты справочника AI_RAG и собирает структуру КомпонентRAG
// с теми же полями, что ДанныеRAGАгента.
// Вызывается из фонового задания векторизации.
//
// Параметры:
//   КомпонентRAGСсылка - СправочникСсылка.AI_RAG
//
// Возвращаемое значение:
//   Структура - поля КомпонентRAG
Функция ПолучитьСтруктуруКомпонентаRAG(КомпонентRAGСсылка) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	AI_RAG.Ссылка                КАК КомпонентRAG,
		|	AI_RAG.Наименование          КАК Наименование,
		|	AI_RAG.Активен               КАК Активен,
		|	AI_RAG.EmbeddingURL          КАК EmbeddingURL,
		|	AI_RAG.EmbeddingМодель       КАК EmbeddingМодель,
		|	AI_RAG.EmbeddingТаймаутСек   КАК EmbeddingТаймаутСек,
		|	AI_RAG.EmbeddingРазмерность  КАК EmbeddingРазмерность,
		|	AI_RAG.EmbeddingAPIКлюч      КАК EmbeddingAPIКлюч,
		|	AI_RAG.QdrantURL             КАК QdrantURL,
		|	AI_RAG.QdrantТаймаутСек      КАК QdrantТаймаутСек,
		|	AI_RAG.QdrantAPIКлюч         КАК QdrantAPIКлюч
		|ИЗ
		|	Справочник.AI_RAG КАК AI_RAG
		|ГДЕ
		|	AI_RAG.Ссылка = &Ссылка";

	Запрос.УстановитьПараметр("Ссылка", КомпонентRAGСсылка);
	Строка = Запрос.Выполнить().Выгрузить()[0];

	Если Не Строка.Активен Тогда
		ВызватьИсключение СтрШаблон("RAG-компонент [%1] не активен", Строка.Наименование);
	КонецЕсли;

	Возврат НовыйКомпонентRAG(Строка);

КонецФункции

// ДобавитьАктуальныйЧанк
// Вспомогательная процедура: добавляет ИдентификаторЧанка в карту актуальных ID по сущности.
// Используется в ОбработатьПорциюВекторизации для отслеживания чанков, которые не являются сиротами.
//
// Параметры:
//   ТекущиеЧанкиПоСущностям - Соответствие (изменяется) - карта ключ→{НавигационнаяСсылка, ТипСущности, МассивID}
//   НавигационнаяСсылка     - Строка
//   ТипСущности             - Строка
//   ИдентификаторЧанка      - УникальныйИдентификатор
Процедура ДобавитьАктуальныйЧанк(ТекущиеЧанкиПоСущностям, НавигационнаяСсылка, ТипСущности, ИдентификаторЧанка)

	Ключ = НавигационнаяСсылка + "|" + ТипСущности;

	Если ТекущиеЧанкиПоСущностям.Получить(Ключ) = Неопределено Тогда
		ТекущиеЧанкиПоСущностям.Вставить(Ключ, Новый Структура(
			"НавигационнаяСсылка, ТипСущности, МассивID",
			НавигационнаяСсылка, ТипСущности, Новый Массив));
	КонецЕсли;

	ТекущиеЧанкиПоСущностям.Получить(Ключ).МассивID.Добавить(ИдентификаторЧанка);

КонецПроцедуры

// УдалитьСтарыеЧанкиСущности
// Находит чанки сущности в AI_ИдентификаторыЧанков, которых нет в переданном массиве актуальных,
// и удаляет их из Qdrant и реестра.
//
// Вызывается в конце ОбработатьПорциюВекторизации после успешной отправки всех новых порций.
// Это гарантирует: новые данные уже в Qdrant до того, как старые удаляются.
//
// Параметры:
//   КомпонентRAG        - Структура - данные RAG-компонента
//   ИмяКоллекции        - Строка    - имя коллекции в Qdrant
//   НавигационнаяСсылка - Строка    - навигационная ссылка сущности
//   ТипСущности         - Строка    - тип сущности (ИсточникВнутреннийТип)
//   НовыеИдентификаторы - Массив    - актуальные ИдентификаторыЧанка (UUID)
Процедура УдалитьСтарыеЧанкиСущности(КомпонентRAG, ИмяКоллекции,
		НавигационнаяСсылка, ТипСущности, НовыеИдентификаторы)

	// 1. Читаем все существующие чанки сущности (нужен полный ключ для МенеджерЗаписи.Удалить)
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ИдЧанков.НавигационнаяСсылка КАК НавигационнаяСсылка,
		|	ИдЧанков.ТипСущности         КАК ТипСущности,
		|	ИдЧанков.НомерЧанка          КАК НомерЧанка,
		|	ИдЧанков.ИдентификаторЧанка  КАК ИдентификаторЧанка,
		|	ИдЧанков.ХешДанных           КАК ХешДанных
		|ИЗ
		|	РегистрСведений.AI_ИдентификаторыЧанков КАК ИдЧанков
		|ГДЕ
		|	ИдЧанков.НавигационнаяСсылка = &НавигационнаяСсылка
		|	И ИдЧанков.ТипСущности = &ТипСущности";
	Запрос.УстановитьПараметр("НавигационнаяСсылка", НавигационнаяСсылка);
	Запрос.УстановитьПараметр("ТипСущности",          ТипСущности);
	ЗаписиРеестра = Запрос.Выполнить().Выгрузить();

	// 2. Строим множество актуальных ID для быстрой проверки
	НовыеIDСоответствие = Новый Соответствие;
	Для Каждого НовыйID Из НовыеИдентификаторы Цикл
		НовыеIDСоответствие.Вставить(Строка(НовыйID), Истина);
	КонецЦикла;

	// 3. Находим сирот
	МассивСиротQdrant = Новый Массив;
	ЗаписиСирот = Новый Массив;
	Для Каждого ЗаписьРеестра Из ЗаписиРеестра Цикл
		ИДСтрокой = Строка(ЗаписьРеестра.ИдентификаторЧанка);
		Если НовыеIDСоответствие.Получить(ИДСтрокой) = Неопределено Тогда
			Если МассивСиротQdrant.Найти(ИДСтрокой) = Неопределено Тогда
				МассивСиротQdrant.Добавить(ИДСтрокой);
			КонецЕсли;
			ЗаписиСирот.Добавить(ЗаписьРеестра);
		КонецЕсли;
	КонецЦикла;

	Если МассивСиротQdrant.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	// 4. Сначала Qdrant, потом реестр: если Qdrant не ответил, записи реестра
	// остаются, и следующая векторизация сущности снова найдет этих сирот.
	РезультатУдаления = УдалитьТочкиИзQdrant(КомпонентRAG, ИмяКоллекции, МассивСиротQdrant);
	Если Не РезультатУдаления.Успех Тогда
		ЗаписьЖурналаРегистрации("AI_RAG.Векторизация",
			УровеньЖурналаРегистрации.Ошибка, , ,
			СтрШаблон("Ошибка удаления сирот из Qdrant [%1/%2]: %3",
				ТипСущности, НавигационнаяСсылка, РезультатУдаления.Описание));
		Возврат;
	КонецЕсли;

	// 5. Удаляем записи реестра (полный ключ известен из выборки)
	Для Каждого ЗаписьСироты Из ЗаписиСирот Цикл
		МенеджерЗаписи = РегистрыСведений.AI_ИдентификаторыЧанков.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.НавигационнаяСсылка = ЗаписьСироты.НавигационнаяСсылка;
		МенеджерЗаписи.ТипСущности          = ЗаписьСироты.ТипСущности;
		МенеджерЗаписи.НомерЧанка           = ЗаписьСироты.НомерЧанка;
		МенеджерЗаписи.ИдентификаторЧанка   = ЗаписьСироты.ИдентификаторЧанка;
		МенеджерЗаписи.ХешДанных            = ЗаписьСироты.ХешДанных;
		МенеджерЗаписи.Удалить();
	КонецЦикла;

	ЗаписьЖурналаРегистрации("AI_RAG.Векторизация",
		УровеньЖурналаРегистрации.Информация, , ,
		СтрШаблон("Удалено %1 устаревших чанков сущности [%2/%3]",
			МассивСиротQdrant.Количество(), ТипСущности, НавигационнаяСсылка));

КонецПроцедуры

// УдалитьТочкиИзQdrant
// Удаляет точки из коллекции Qdrant по массиву строковых ID.
// Использует POST /collections/{name}/points/delete с телом { "points": [...] }.
// Операция идемпотентна — повторное удаление несуществующих точек безопасно.
//
// Параметры:
//   КомпонентRAG          - Структура - данные RAG-компонента (QdrantURL, QdrantAPIКлюч)
//   ИмяКоллекции          - Строка    - имя коллекции в Qdrant
//   МассивИдентификаторов - Массив    - строковые UUID точек для удаления
//
// Возвращаемое значение:
//   Структура - { Успех: Булево, Описание: Строка }
Функция УдалитьТочкиИзQdrant(КомпонентRAG, ИмяКоллекции, МассивИдентификаторов)

	Результат = НовыйРезультатОперации();

	Если МассивИдентификаторов.Количество() = 0 Тогда
		Результат.Успех = Истина;
		Возврат Результат;
	КонецЕсли;

	Тело = Новый Структура;
	Тело.Вставить("points", МассивИдентификаторов);

	Попытка
		Ответ = ВыполнитьЗапросQdrant(КомпонентRAG, "POST",
			СтрШаблон("/collections/%1/points/delete?wait=true", ИмяКоллекции), Тело);
		ПроверитьОтветСервиса("Qdrant", Ответ,
			СтрШаблон("удаление точек из коллекции [%1]", ИмяКоллекции));
		Результат.Успех = Истина;
	Исключение
		Результат.Описание = "Ошибка при удалении точек из Qdrant: " + ОписаниеОшибки();
	КонецПопытки;

	Возврат Результат;

КонецФункции

#КонецОбласти
